[
  {
    "title": "1. Understanding Foundation Types",
    "date": "2025-07-26",
    "image": "http://www.polytechnichub.com/wp-content/uploads/2018/05/Spared-Footing.png",
    "content": "Foundations are the most critical part of any building, as they transfer the structure’s load safely to the ground. A good foundation ensures stability, prevents settlement, and protects the building from moisture and ground movement. Based on the soil and building type, foundations are broadly classified as shallow or deep. Shallow foundations are used for smaller structures on strong soil, while deep foundations like piles are used for high-rise buildings or weak soil conditions."
  },
  {
    "title": "2. Vastu for Residential Planning",
    "date": "2025-07-25",
    "image": "https://monicawadkar.com/wp-content/uploads/2024/04/Building-Layout-1024x1006.jpg",
    "content": "Vastu Shastra is an ancient Indian architectural science that aims to create harmony between people and their living spaces. In residential buildings, Vastu focuses on the correct placement of rooms—like having the kitchen in the southeast, the master bedroom in the southwest, and entrances in the east or north—to promote health, happiness, and prosperity. Following Vastu principles helps in balancing natural energies and enhancing overall well-being at home."
  },
  {
    "title": "3. RCC Column, Beam and Slab Basics",
    "date": "2025-07-24",
    "image": "http://www.qtoconstruction.com/constuction/img/calculation-formula-of-column-beam-and-slab.jpg",
    "content": "Columns, beams, and slabs are the core structural elements in any reinforced concrete building. Columns carry vertical loads to the foundation, beams span horizontally between columns to support slabs, and slabs form the floors and roofs. Together, they work as a frame system that ensures the building's strength, stability, and safe load transfer."
  },
  {
    "title": "4. Importance of Waterproofing",
    "date": "2025-07-23",
    "image": "http://waterproofingcontractors.co.in/waterproofing-solutions/wp-content/uploads/2019/12/building-construciton-waterproofing1-1.jpg",
   "content": "Waterproofing is essential to protect a building from water seepage and moisture damage. It prevents leaks, damp walls, and structural deterioration, ensuring durability and a healthy indoor environment. Proper waterproofing increases the lifespan of the structure and reduces long-term maintenance costs."
  },
  {
    "title": "5. Brick vs Concrete Blocks",
    "date": "2025-07-22",
    "image": "https://i.ytimg.com/vi/JBPvb6_Mc24/maxresdefault.jpg",
    "content": "Bricks and concrete blocks are popular building materials with key differences. Bricks are traditional, durable, and offer better thermal insulation, while concrete blocks are larger, faster to build with, and more cost-effective for large projects. The choice depends on design needs, budget, and local availability."
  },
  {
    "title": "6. Electrical Planning in Homes",
    "date": "2025-07-21",
    "image": "https://tse1.mm.bing.net/th/id/OIP.z-XT7Mr2RR5C1MSUj_KmogHaE8?pid=Api&P=0&h=180",
    "content": "Electrical planning is crucial in home design to ensure safety, convenience, and energy efficiency. It involves strategically placing switches, lights, sockets, and load circuits to match your lifestyle needs. Proper planning prevents future rewiring, supports smart home integration, and enhances overall functionality."
  },
  {
    "title": "7. Types of Flooring Materials",
    "date": "2025-07-20",
    "image": "https://i.ytimg.com/vi/bTTn-WWdc3Q/maxresdefault.jpg",
    "content": "There are various flooring materials available, each with unique features. Common types include tiles, marble, granite, wooden flooring, vinyl, and concrete. The choice depends on aesthetics, durability, budget, and room usage. A good flooring choice enhances comfort and elevates interior design."
  },
  {
    "title": "8. Plastering & Finishing Tips",
    "date": "2025-07-19",
    "image": "https://www.jkcement.com/wp-content/uploads/2023/07/builder-using-plastering-tool-finishing-old-wall-1024x768-jpg.webp",
   "content": "Plastering gives walls a smooth, strong surface ready for painting or tiling. Key tips include using the right mix ratio, ensuring surface cleanliness, applying in even coats, and curing properly. Good finishing improves durability, enhances aesthetics, and prevents cracks or flaking over time."
  },
  {
    "title": "9. Site Safety Measures",
    "date": "2025-07-18",
    "image": "https://www.alertmedia.com/wp-content/uploads/2022/06/Blog-Construction-Safety-PPE-V1_PPE.jpg",
    "content": "Site safety is vital to prevent accidents and ensure smooth construction. Key measures include using protective gear, proper scaffolding, clear signage, regular safety drills, and maintaining clean, hazard-free zones. A safety-first approach protects workers and boosts project efficiency."
  },
  {
    "title": "10. Rainwater Harvesting Basics",
    "date": "2025-07-17",
    "image": "https://media.geeksforgeeks.org/wp-content/uploads/20231108115542/Rainwater-Harvesting.png",
   "content": "Rainwater harvesting is a sustainable method to collect and store rainwater for reuse. It involves rooftop catchments, gutters, filters, and storage tanks. This system reduces water bills, prevents waterlogging, and conserves groundwater. Ideal for both residential and commercial buildings."
  }
]




