[
  {
    "title": "1. Understanding Foundation Types",
    "date": "2025-07-26",
    "image": "https://source.unsplash.com/800x400/?foundation,construction",
    "content":  [
  {
    "heading": "Importance of Foundations in Construction",
    "body": [
      "A foundation is the lowest part of a building structure that transfers the load of the building safely to the ground.",
      "Foundations are essential for structural integrity, preventing settlement, and ensuring long-term durability."
    ],
    "points": [
      "Load Distribution – spreads the weight of the structure evenly across the soil.",
      "Stability – anchors the structure, preventing tilting or collapse.",
      "Prevents Settlement – reduces the risk of uneven sinking or cracking.",
      "Moisture Protection – protects against groundwater and dampness.",
      "Improved Durability – enhances the lifespan of the building."
    ]
  },
  {
    "heading": "Types of Foundations",
    "body": [
      "Foundations are mainly categorized into two types: Shallow Foundations and Deep Foundations. Each is chosen based on soil conditions, structure type, and load factors."
    ]
  },
  {
    "heading": "Shallow Foundations",
    "body": [
      "Shallow foundations are used when surface soil has adequate load-bearing capacity. They are economical and easy to construct."
    ],
    "points": [
      "Isolated Footing – supports a single column. Common in small buildings.",
      "Combined Footing – supports two or more columns, used when they are close together.",
      "Strip Footing – continuous footing under walls. Suitable for load-bearing walls.",
      "Raft Foundation – a large concrete slab supporting multiple columns and walls. Ideal for weak soils."
    ]
  },
  {
    "heading": "Deep Foundations",
    "body": [
      "Deep foundations are used when surface soil is weak, and load must be transferred to deeper, stronger layers."
    ],
    "points": [
      "Pile Foundation – long, slender columns driven deep into the ground. Used in high-rise buildings and bridges.",
      "Pier Foundation – vertical cylindrical supports constructed by excavating and concreting in place.",
      "Caisson Foundation – watertight retaining structure, often used in underwater or bridge projects."
    ]
  },
  {
    "heading": "Quick Comparison Table",
    "table": {
      "headers": ["Foundation Type", "Depth", "Cost", "Used For"],
      "rows": [
        ["Shallow (e.g., Isolated)", "< 3m", "Low", "Small buildings"],
        ["Deep (e.g., Pile)", "> 3m", "High", "High-rise buildings or poor soil"]
      ]
    }
  },
  {
    "heading": "How to Choose the Right Foundation",
    "points": [
      "Type and weight of the structure",
      "Soil bearing capacity",
      "Depth of groundwater table",
      "Construction budget and timeline",
      "Surrounding conditions (like adjacent buildings or slope)"
    ]
  }
]

  {
    "title": "2. Vastu for Residential Planning",
    "date": "2025-07-25",
    "image": "https://source.unsplash.com/800x400/?vastu,plan",
    "content": "Vastu Shastra guides room placement for harmony. Kitchen in SE, master bedroom SW, and entrance in NE are common practices."
  },
  {
    "title": "3. RCC Column, Beam and Slab Basics",
    "date": "2025-07-24",
    "image": "https://source.unsplash.com/800x400/?rcc,beam",
    "content": "Reinforced Concrete Cement (RCC) forms the skeleton of modern buildings. Proper lapping, cover, and bar bending are key for safety."
  },
  {
    "title": "4. Importance of Waterproofing",
    "date": "2025-07-23",
    "image": "https://source.unsplash.com/800x400/?waterproofing,roof",
    "content": "Leakages weaken structures. Common waterproofing includes brush coat, membrane, and chemical-based methods like Dr. Fixit."
  },
  {
    "title": "5. Brick vs Concrete Blocks",
    "date": "2025-07-22",
    "image": "https://source.unsplash.com/800x400/?bricks,blocks",
    "content": "Bricks offer thermal insulation; blocks offer cost & speed. AAC blocks are light and popular in modern homes."
  },
  {
    "title": "6. Electrical Planning in Homes",
    "date": "2025-07-21",
    "image": "https://source.unsplash.com/800x400/?electrical,wiring",
    "content": "Plan switchboards early. Use MCBs and ELCBs for safety. Mark TV, AC, and kitchen points before plastering."
  },
  {
    "title": "7. Types of Flooring Materials",
    "date": "2025-07-20",
    "image": "https://source.unsplash.com/800x400/?flooring,tiles",
    "content": "Popular options include vitrified tiles, granite, marble, and wooden flooring. Vitrified tiles are cost-effective and durable."
  },
  {
    "title": "8. Plastering & Finishing Tips",
    "date": "2025-07-19",
    "image": "https://source.unsplash.com/800x400/?plastering,construction",
    "content": "Apply 2 layers—rough and smooth. Always cure for 7 days. Add chicken mesh at brick-RCC joints to prevent cracks."
  },
  {
    "title": "9. Site Safety Measures",
    "date": "2025-07-18",
    "image": "https://source.unsplash.com/800x400/?construction,safety",
    "content": "Safety helmets, gloves, and netting are essential. Keep first-aid and signage on site. Supervision reduces accidents."
  },
  {
    "title": "10. Rainwater Harvesting Basics",
    "date": "2025-07-17",
    "image": "https://source.unsplash.com/800x400/?rainwater,harvesting",
    "content": "Capture roof runoff using pipes and store in a sump. Add filters before storage. Helps recharge borewells and save water."
  }
]




