[
  {
    "title": "1. Understanding Foundation Types",
    "date": "2025-07-26",
    "image": "https://media.istockphoto.com/id/2183290916/photo/a-hindu-family-gathered-around-a-sacred-fire-performing-a-yagya-during-a-festival-celebration.webp?a=1&b=1&s=612x612&w=0&k=20&c=RfRvDqsajF46qGzyYRVLxbIpohK0wltihdjolLEwfpw=",
    "content": "Foundations are the most critical part of any building, as they transfer the structure’s load safely to the ground. A good foundation ensures stability, prevents settlement, and protects the building from moisture and ground movement. Based on the soil and building type, foundations are broadly classified as shallow or deep. Shallow foundations are used for smaller structures on strong soil, while deep foundations like piles are used for high-rise buildings or weak soil conditions."
  },
  {
    "title": "2. Vastu for Residential Planning",
    "date": "2025-07-25",
    "image": "https://source.unsplash.com/800x400/?vastu,plan",
    "content": "Vastu Shastra is an ancient Indian architectural science that aims to create harmony between people and their living spaces. In residential buildings, Vastu focuses on the correct placement of rooms—like having the kitchen in the southeast, the master bedroom in the southwest, and entrances in the east or north—to promote health, happiness, and prosperity. Following Vastu principles helps in balancing natural energies and enhancing overall well-being at home."

  },
  {
    "title": "3. RCC Column, Beam and Slab Basics",
    "date": "2025-07-24",
    "image": "https://source.unsplash.com/800x400/?rcc,beam",
    "content": "Reinforced Concrete Cement (RCC) forms the skeleton of modern buildings. Proper lapping, cover, and bar bending are key for safety."
  },
  {
    "title": "4. Importance of Waterproofing",
    "date": "2025-07-23",
    "image": "https://source.unsplash.com/800x400/?waterproofing,roof",
    "content": "Leakages weaken structures. Common waterproofing includes brush coat, membrane, and chemical-based methods like Dr. Fixit."
  },
  {
    "title": "5. Brick vs Concrete Blocks",
    "date": "2025-07-22",
    "image": "https://source.unsplash.com/800x400/?bricks,blocks",
    "content": "Bricks offer thermal insulation; blocks offer cost & speed. AAC blocks are light and popular in modern homes."
  },
  {
    "title": "6. Electrical Planning in Homes",
    "date": "2025-07-21",
    "image": "https://source.unsplash.com/800x400/?electrical,wiring",
    "content": "Plan switchboards early. Use MCBs and ELCBs for safety. Mark TV, AC, and kitchen points before plastering."
  },
  {
    "title": "7. Types of Flooring Materials",
    "date": "2025-07-20",
    "image": "https://source.unsplash.com/800x400/?flooring,tiles",
    "content": "Popular options include vitrified tiles, granite, marble, and wooden flooring. Vitrified tiles are cost-effective and durable."
  },
  {
    "title": "8. Plastering & Finishing Tips",
    "date": "2025-07-19",
    "image": "https://source.unsplash.com/800x400/?plastering,construction",
    "content": "Apply 2 layers—rough and smooth. Always cure for 7 days. Add chicken mesh at brick-RCC joints to prevent cracks."
  },
  {
    "title": "9. Site Safety Measures",
    "date": "2025-07-18",
    "image": "https://source.unsplash.com/800x400/?construction,safety",
    "content": "Safety helmets, gloves, and netting are essential. Keep first-aid and signage on site. Supervision reduces accidents."
  },
  {
    "title": "10. Rainwater Harvesting Basics",
    "date": "2025-07-17",
    "image": "https://source.unsplash.com/800x400/?rainwater,harvesting",
    "content": "Capture roof runoff using pipes and store in a sump. Add filters before storage. Helps recharge borewells and save water."
  }
]




